#+TITLE: My Emacs Preferences
#+latex_compiler: xelatex
#+latex_header: \usemintedstyle{emacs}

** Org babel

#+begin_src emacs-lisp
(use-package ob-restclient
  :defer t)

(use-package org
  :custom
  (org-babel-load-languages '((ditaa . t)
                              (gnuplot .t)
                              (python . t)
                              (haskell . t)
                              (scheme . t)
                              (js . t)
                              (restclient . t)
                              (shell . t)
                              ))

  (python-shell-completion-native-enable nil)

  (haskell-process-type 'stack-ghci)
  (haskell-program-name "ghci")

  :config
  (use-package gnuplot :commands gnuplot-mode)
  )
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24810 63568 883307 0) :init (24810 63568 883297 0) :config (24810 63568 883292 0) :config-secs (0 0 1414 0) :init-secs (0 0 1451 0) :use-package-secs (0 0 14557 0)))

* Playground

Try out stuff here and execute manually.

#+begin_src emacs-lisp :tangle no
(+ 1 1)

(defun scroll-up-benchmark ()
  (interactive)
  (end-of-buffer)
  (redisplay)
  (let ((oldgc gcs-done)
        (oldtime (float-time)))
    (condition-case nil (while t (previous-line) (redisplay))
      (error (message "GCs: %d Elapsed time: %f seconds"
                      (- gcs-done oldgc) (- (float-time) oldtime))))))

(defun scroll-up-profile ()
  (interactive)
  (end-of-buffer)
  (redisplay)
  (when (fboundp 'profiler-stop)
    (profiler-stop))
  (profiler-start 'cpu)
  (let ((oldgc gcs-done)
        (oldtime (float-time)))
    (condition-case nil (while t (previous-line) (redisplay))
      (error (message "GCs: %d Elapsed time: %f seconds"
                        (- gcs-done oldgc) (- (float-time) oldtime))))
    (profiler-report)
    (profiler-stop)))
#+end_src


#+RESULTS:
: 2

